'''
Created on 2018/08/59

@author: User
'''

import numpy as np

if __name__ == '__main__':
    array = np.arange(11)         #[ 0  1  2  3  4  5  6  7  8  9 10]

    #平方根
    print(np.sqrt(array))
    '''
    [0.         1.         1.41421356 1.73205081 2.         2.23606798
     2.44948974 2.64575131 2.82842712 3.         3.16227766]
    '''

    #自然対数の底
    print(np.exp(array))
    '''
    [1.00000000e+00 2.71828183e+00 7.38905610e+00 2.00855369e+01
     5.45981500e+01 1.48413159e+02 4.03428793e+02 1.09663316e+03
     2.98095799e+03 8.10308393e+03 2.20264658e+04]
    '''

    #標準正規分布に従ったランダム値生成
    #実行するたびに値は変わる
    A = np.random.randn(10)
    print(A)
    B = np.random.randn(10)
    print(B)

    #2つの配列の、それぞれの大きい要素を選んで配列を作る
    print(np.maximum(A,B))

    #各要素を足す
    print(np.add(A,B))

    pass

